app/controllers/api/v1/transactions/invoice_controller.rb

      def index
        respond_with Transaction.find(params[:transaction_id]).invoice
---
SELECT  "invoices".* FROM "invoices" WHERE "invoices"."id" = $1 LIMIT 1  [["id", 1]]
SELECT  "transactions".* FROM "transactions" WHERE "transactions"."id" = $1 LIMIT 1  [["id", 1]]