app/controllers/api/v1/invoices/customer_controller.rb

SELECT  "customers".* FROM "customers" WHERE "customers"."id" = $1 LIMIT 1  [["id", 1]]
SELECT  "invoices".* FROM "invoices" WHERE "invoices"."id" = $1 LIMIT 1  [["id", 1]]
---
      def index
        respond_with Invoice.find(params[:invoice_id]).customer