app/controllers/api/v1/invoices/invoice_items_controller.rb

SELECT  "invoices".* FROM "invoices" WHERE "invoices"."id" = $1 LIMIT 1  [["id", 1]]
SELECT "invoice_items".* FROM "invoice_items" WHERE "invoice_items"."invoice_id" = $1  ORDER BY "invoice_items"."id" ASC  [["invoice_id", 1]]
---
      def index
        respond_with Invoice.find(params[:invoice_id]).invoice_items