app/controllers/api/v1/invoices/items_controller.rb

      def index
        respond_with Invoice.find(params[:invoice_id]).items
---
SELECT  "invoices".* FROM "invoices" WHERE "invoices"."id" = $1 LIMIT 1  [["id", 1]]
SELECT "items".* FROM "items" INNER JOIN "invoice_items" ON "items"."id" = "invoice_items"."item_id" WHERE "invoice_items"."invoice_id" = $1  ORDER BY "items"."id" ASC, "invoice_items"."id" ASC  [["invoice_id", 1]]