app/controllers/api/v1/invoices/merchant_controller.rb

      def index
        respond_with Invoice.find(params[:invoice_id]).merchant
---
SELECT  "invoices".* FROM "invoices" WHERE "invoices"."id" = $1 LIMIT 1  [["id", 1]]
SELECT  "merchants".* FROM "merchants" WHERE "merchants"."id" = $1 LIMIT 1  [["id", 1]]