app/controllers/api/v1/invoices/transactions_controller.rb

      def index
        respond_with Invoice.find(params[:invoice_id]).transactions
---
SELECT  "invoices".* FROM "invoices" WHERE "invoices"."id" = $1 LIMIT 1  [["id", 1]]
SELECT "transactions".* FROM "transactions" WHERE "transactions"."invoice_id" = $1  [["invoice_id", 1]]