app/controllers/api/v1/merchants/customers_with_pending_invoices_controller.rb

      def index
        respond_with Merchant.find(params[:merchant_id]).customers_with_pending_invoices
---
SELECT  "customers".* FROM "customers" WHERE "customers"."id" = $1 LIMIT 1  [["id", 2]]
SELECT  "merchants".* FROM "merchants" WHERE "merchants"."id" = $1 LIMIT 1  [["id", 2]]