app/controllers/api/v1/merchants/favorite_customer_controller.rb

SELECT  "merchants".* FROM "merchants" WHERE "merchants"."id" = $1 LIMIT 1  [["id", 1]]
---
      def show
        respond_with Merchant.find(params[:merchant_id]).favorite_customer