app/controllers/api/v1/merchants/invoices_controller.rb

      def index
        respond_with Merchant.find(params[:merchant_id]).invoices
---
SELECT  "merchants".* FROM "merchants" WHERE "merchants"."id" = $1 LIMIT 1  [["id", 1]]
SELECT "invoices".* FROM "invoices" WHERE "invoices"."merchant_id" = $1  [["merchant_id", 1]]