app/controllers/api/v1/merchants/items_controller.rb

SELECT  "merchants".* FROM "merchants" WHERE "merchants"."id" = $1 LIMIT 1  [["id", 1]]
SELECT "items".* FROM "items" WHERE "items"."merchant_id" = $1  ORDER BY "items"."id" ASC  [["merchant_id", 1]]
---
      def index
        respond_with Merchant.find(params[:merchant_id]).items