app/controllers/api/v1/merchants/revenue_controller.rb

SELECT  "merchants".* FROM "merchants" WHERE "merchants"."id" = $1 LIMIT 1  [["id", 1]]
---
      def show
        respond_with Merchant.find(params[:merchant_id]).merchant_revenue(params[:date]), serializer: MerchantTotalRevenueSerializer