app/controllers/api/v1/customers_controller.rb

SELECT "customers".* FROM "customers"
---
      def index
        respond_with Customer.all

SELECT  "customers".* FROM "customers" WHERE "customers"."id" = $1 LIMIT 1  [["id", 0]]
---
      def show
        respond_with Customer.find(params[:id])