app/controllers/api/v1/invoices_controller.rb

SELECT "invoices".* FROM "invoices"
---
      def index
        respond_with Invoice.all

SELECT  "invoices".* FROM "invoices" WHERE "invoices"."id" = $1 LIMIT 1  [["id", 1]]
---
      def show
        respond_with Invoice.find(params[:id])