app/controllers/api/v1/invoice_items_controller.rb

SELECT "invoice_items".* FROM "invoice_items"  ORDER BY "invoice_items"."id" ASC
---
      def index
        respond_with InvoiceItem.all

SELECT  "invoice_items".* FROM "invoice_items" WHERE "invoice_items"."id" = $1  ORDER BY "invoice_items"."id" ASC LIMIT 1  [["id", 1]]
---
      def show
        respond_with InvoiceItem.find(params[:id])