app/controllers/api/v1/items_controller.rb

SELECT "items".* FROM "items"  ORDER BY "items"."id" ASC
---
      def index
        respond_with Item.all

SELECT  "items".* FROM "items" WHERE "items"."id" = $1  ORDER BY "items"."id" ASC LIMIT 1  [["id", 1]]
---
      def show
        respond_with Item.find(params[:id])