app/controllers/api/v1/merchants_controller.rb

      def index
        respond_with Merchant.all
---
SELECT "merchants".* FROM "merchants"

      def show
        respond_with Merchant.find(params[:id])
---
SELECT  "merchants".* FROM "merchants" WHERE "merchants"."id" = $1 LIMIT 1  [["id", 1]]