app/controllers/api/v1/transactions_controller.rb

      def index
        respond_with Transaction.all
---
SELECT "transactions".* FROM "transactions"

      def show
        respond_with Transaction.find(params[:id])
---
SELECT  "transactions".* FROM "transactions" WHERE "transactions"."id" = $1 LIMIT 1  [["id", 1]]