app/controllers/api/v1/items/invoice_items_controller.rb

      def index
        respond_with Item.find(params[:item_id]).invoice_items
---
SELECT  "items".* FROM "items" WHERE "items"."id" = $1  ORDER BY "items"."id" ASC LIMIT 1  [["id", 1]]
SELECT "invoice_items".* FROM "invoice_items" WHERE "invoice_items"."item_id" = $1  ORDER BY "invoice_items"."id" ASC  [["item_id", 1]]