app/controllers/api/v1/items/merchant_controller.rb

SELECT  "items".* FROM "items" WHERE "items"."id" = $1  ORDER BY "items"."id" ASC LIMIT 1  [["id", 1]]
SELECT  "merchants".* FROM "merchants" WHERE "merchants"."id" = $1 LIMIT 1  [["id", 1]]
---
      def index
        respond_with Item.find(params[:item_id]).merchant