app/controllers/api/v1/customers/favorite_merchant_controller.rb

      def show
        respond_with Customer.find(params[:customer_id]).favorite_merchant
---
SELECT  "customers".* FROM "customers" WHERE "customers"."id" = $1 LIMIT 1  [["id", 1]]