app/controllers/api/v1/customers/invoices_controller.rb

      def index
        respond_with Customer.find(params[:customer_id]).invoices
---
SELECT  "customers".* FROM "customers" WHERE "customers"."id" = $1 LIMIT 1  [["id", 1]]
SELECT "invoices".* FROM "invoices" WHERE "invoices"."customer_id" = $1  [["customer_id", 1]]