app/controllers/api/v1/customers/transactions_controller.rb

SELECT  "customers".* FROM "customers" WHERE "customers"."id" = $1 LIMIT 1  [["id", 1]]
SELECT "transactions".* FROM "transactions" INNER JOIN "invoices" ON "transactions"."invoice_id" = "invoices"."id" WHERE "invoices"."customer_id" = $1  [["customer_id", 1]]
---
      def index
        respond_with Customer.find(params[:customer_id]).transactions