app/controllers/api/v1/invoice_items/invoice_controller.rb

      def index
        respond_with InvoiceItem.find(params[:invoice_item_id]).invoice
---
SELECT  "invoice_items".* FROM "invoice_items" WHERE "invoice_items"."id" = $1  ORDER BY "invoice_items"."id" ASC LIMIT 1  [["id", 1]]
SELECT  "invoices".* FROM "invoices" WHERE "invoices"."id" = $1 LIMIT 1  [["id", 1]]