app/controllers/api/v1/invoice_items/item_controller.rb

      def index
        respond_with InvoiceItem.find(params[:invoice_item_id]).item
---
SELECT  "invoice_items".* FROM "invoice_items" WHERE "invoice_items"."id" = $1  ORDER BY "invoice_items"."id" ASC LIMIT 1  [["id", 1]]
SELECT  "items".* FROM "items" WHERE "items"."id" = $1  ORDER BY "items"."id" ASC LIMIT 1  [["id", 1]]